test-plans/23127249_Stress_20260830.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="23127249_Stress_20260830" enabled="true">
      <stringProp name="TestPlan.comments">Ramp 0-&gt;300 VU over 180s to find breaking point.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_HOST" elementType="Argument">
            <stringProp name="Argument.name">BASE_HOST</stringProp><stringProp name="Argument.value">localhost</stringProp><stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="BASE_PORT" elementType="Argument">
            <stringProp name="Argument.name">BASE_PORT</stringProp><stringProp name="Argument.value">3000</stringProp><stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV users" enabled="true">
  <stringProp name="filename">../data/users.csv</stringProp>
  <stringProp name="fileEncoding">UTF-8</stringProp>
  <stringProp name="variableNames">email,password,name</stringProp>
  <boolProp name="ignoreFirstLine">true</boolProp>
  <stringProp name="delimiter">,</stringProp>
  <boolProp name="quotedData">false</boolProp>
  <boolProp name="recycle">true</boolProp>
  <boolProp name="stopThread">false</boolProp>
  <stringProp name="shareMode">shareMode.all</stringProp>
</CSVDataSet>
<hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV products" enabled="true">
  <stringProp name="filename">../data/products.csv</stringProp>
  <stringProp name="fileEncoding">UTF-8</stringProp>
  <stringProp name="variableNames">product_id,name,price,search_term</stringProp>
  <boolProp name="ignoreFirstLine">true</boolProp>
  <stringProp name="delimiter">,</stringProp>
  <boolProp name="quotedData">false</boolProp>
  <boolProp name="recycle">true</boolProp>
  <boolProp name="stopThread">false</boolProp>
  <stringProp name="shareMode">shareMode.all</stringProp>
</CSVDataSet>
<hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV coupons" enabled="true">
  <stringProp name="filename">../data/coupons.csv</stringProp>
  <stringProp name="fileEncoding">UTF-8</stringProp>
  <stringProp name="variableNames">code,min_order_amount</stringProp>
  <boolProp name="ignoreFirstLine">true</boolProp>
  <stringProp name="delimiter">,</stringProp>
  <boolProp name="quotedData">false</boolProp>
  <boolProp name="recycle">true</boolProp>
  <boolProp name="stopThread">false</boolProp>
  <stringProp name="shareMode">shareMode.all</stringProp>
</CSVDataSet>
<hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers" enabled="true">
  <collectionProp name="HeaderManager.headers">
    <elementProp name="" elementType="Header">
      <stringProp name="Header.name">Content-Type</stringProp>
      <stringProp name="Header.value">application/json</stringProp>
    </elementProp>
    
  </collectionProp>
</HeaderManager>
<hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="E2E Stress" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(THREADS,300)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(RAMP,180)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(DURATION,360)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="01 Login (auth)" enabled="true">
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
       <collectionProp name="Arguments.arguments">
         <elementProp name="" elementType="HTTPArgument">
           <boolProp name="HTTPArgument.always_encode">false</boolProp>
           <stringProp name="Argument.value">{"email":"${email}","password":"${password}"}</stringProp>
           <stringProp name="Argument.metadata">=</stringProp>
         </elementProp>
       </collectionProp>
     </elementProp>
  <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/login</stringProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
</HTTPSamplerProxy>
<hashTree>
       <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract token" enabled="true">
  <stringProp name="JSONPostProcessor.referenceNames">authToken</stringProp>
  <stringProp name="JSONPostProcessor.jsonPathExprs">$.token</stringProp>
  <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
  <stringProp name="JSONPostProcessor.defaultValues">NOTFOUND</stringProp>
</JSONPostProcessor>
<hashTree/>
       <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract userId" enabled="true">
  <stringProp name="JSONPostProcessor.referenceNames">userId</stringProp>
  <stringProp name="JSONPostProcessor.jsonPathExprs">$.user.id</stringProp>
  <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
  <stringProp name="JSONPostProcessor.defaultValues">NOTFOUND</stringProp>
</JSONPostProcessor>
<hashTree/>
       <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert login" enabled="true">
  <collectionProp name="Asserion.test_strings">
    <stringProp name="chk">Login successful</stringProp>
  </collectionProp>
  <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
  <intProp name="Assertion.test_type">16</intProp>
</ResponseAssertion>
<hashTree/>
     </hashTree>
<UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think 300-700ms" enabled="true">
  <stringProp name="ConstantTimer.delay">300</stringProp>
  <stringProp name="RandomTimer.range">400</stringProp>
</UniformRandomTimer>
<hashTree/>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="02 Search products (read)" enabled="true">
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
       <collectionProp name="Arguments.arguments"/>
     </elementProp>
  <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/products?search=${search_term}</stringProp>
  <stringProp name="HTTPSampler.method">GET</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
</HTTPSamplerProxy>
<hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status search" enabled="true">
  <collectionProp name="Asserion.test_strings">
    <stringProp name="cd">200</stringProp>
  </collectionProp>
  <stringProp name="Assertion.custom_message">Unexpected HTTP status</stringProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
  <intProp name="Assertion.test_type">8</intProp>
</ResponseAssertion>
<hashTree/></hashTree>
<UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think 300-700ms" enabled="true">
  <stringProp name="ConstantTimer.delay">300</stringProp>
  <stringProp name="RandomTimer.range">400</stringProp>
</UniformRandomTimer>
<hashTree/>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="03 Product detail (read)" enabled="true">
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
       <collectionProp name="Arguments.arguments"/>
     </elementProp>
  <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/products/${product_id}</stringProp>
  <stringProp name="HTTPSampler.method">GET</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
</HTTPSamplerProxy>
<hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status detail" enabled="true">
  <collectionProp name="Asserion.test_strings">
    <stringProp name="cd">200</stringProp>
  </collectionProp>
  <stringProp name="Assertion.custom_message">Unexpected HTTP status</stringProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
  <intProp name="Assertion.test_type">8</intProp>
</ResponseAssertion>
<hashTree/></hashTree>
<UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think 300-700ms" enabled="true">
  <stringProp name="ConstantTimer.delay">300</stringProp>
  <stringProp name="RandomTimer.range">400</stringProp>
</UniformRandomTimer>
<hashTree/>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="04 Add to cart (txn)" enabled="true">
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
       <collectionProp name="Arguments.arguments">
         <elementProp name="" elementType="HTTPArgument">
           <boolProp name="HTTPArgument.always_encode">false</boolProp>
           <stringProp name="Argument.value">{"id":${product_id},"name":"${name}","price":${price},"quantity":1}</stringProp>
           <stringProp name="Argument.metadata">=</stringProp>
         </elementProp>
       </collectionProp>
     </elementProp>
  <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/cart</stringProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
</HTTPSamplerProxy>
<hashTree><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers" enabled="true">
  <collectionProp name="HeaderManager.headers">
    <elementProp name="" elementType="Header">
      <stringProp name="Header.name">Content-Type</stringProp>
      <stringProp name="Header.value">application/json</stringProp>
    </elementProp>
    <elementProp name="" elementType="Header">
       <stringProp name="Header.name">Authorization</stringProp>
       <stringProp name="Header.value">Bearer ${authToken}</stringProp>
     </elementProp>
  </collectionProp>
</HeaderManager>
<hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status cart" enabled="true">
  <collectionProp name="Asserion.test_strings">
    <stringProp name="cd">200</stringProp>
  </collectionProp>
  <stringProp name="Assertion.custom_message">Unexpected HTTP status</stringProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
  <intProp name="Assertion.test_type">8</intProp>
</ResponseAssertion>
<hashTree/></hashTree>
<UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think 300-700ms" enabled="true">
  <stringProp name="ConstantTimer.delay">300</stringProp>
  <stringProp name="RandomTimer.range">400</stringProp>
</UniformRandomTimer>
<hashTree/>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="05 Apply coupon (txn)" enabled="true">
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
       <collectionProp name="Arguments.arguments">
         <elementProp name="" elementType="HTTPArgument">
           <boolProp name="HTTPArgument.always_encode">false</boolProp>
           <stringProp name="Argument.value">{"code":"${code}","total_amount":${price},"user_id":${userId}}</stringProp>
           <stringProp name="Argument.metadata">=</stringProp>
         </elementProp>
       </collectionProp>
     </elementProp>
  <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/apply-coupon</stringProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
</HTTPSamplerProxy>
<hashTree><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers" enabled="true">
  <collectionProp name="HeaderManager.headers">
    <elementProp name="" elementType="Header">
      <stringProp name="Header.name">Content-Type</stringProp>
      <stringProp name="Header.value">application/json</stringProp>
    </elementProp>
    <elementProp name="" elementType="Header">
       <stringProp name="Header.name">Authorization</stringProp>
       <stringProp name="Header.value">Bearer ${authToken}</stringProp>
     </elementProp>
  </collectionProp>
</HeaderManager>
<hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert coupon" enabled="true">
  <collectionProp name="Asserion.test_strings">
    <stringProp name="chk">final_amount</stringProp>
  </collectionProp>
  <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
  <intProp name="Assertion.test_type">16</intProp>
</ResponseAssertion>
<hashTree/></hashTree>
<UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think 300-700ms" enabled="true">
  <stringProp name="ConstantTimer.delay">300</stringProp>
  <stringProp name="RandomTimer.range">400</stringProp>
</UniformRandomTimer>
<hashTree/>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="06 Checkout (txn)" enabled="true">
  <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
       <collectionProp name="Arguments.arguments">
         <elementProp name="" elementType="HTTPArgument">
           <boolProp name="HTTPArgument.always_encode">false</boolProp>
           <stringProp name="Argument.value">{"total_amount":${price},"shipping_address":"123 Le Loi, TP.HCM"}</stringProp>
           <stringProp name="Argument.metadata">=</stringProp>
         </elementProp>
       </collectionProp>
     </elementProp>
  <stringProp name="HTTPSampler.domain">${BASE_HOST}</stringProp>
  <stringProp name="HTTPSampler.port">${BASE_PORT}</stringProp>
  <stringProp name="HTTPSampler.protocol">http</stringProp>
  <stringProp name="HTTPSampler.path">/api/checkout</stringProp>
  <stringProp name="HTTPSampler.method">POST</stringProp>
  <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
  <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
  <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
</HTTPSamplerProxy>
<hashTree><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Headers" enabled="true">
  <collectionProp name="HeaderManager.headers">
    <elementProp name="" elementType="Header">
      <stringProp name="Header.name">Content-Type</stringProp>
      <stringProp name="Header.value">application/json</stringProp>
    </elementProp>
    <elementProp name="" elementType="Header">
       <stringProp name="Header.name">Authorization</stringProp>
       <stringProp name="Header.value">Bearer ${authToken}</stringProp>
     </elementProp>
  </collectionProp>
</HeaderManager>
<hashTree/><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Status checkout" enabled="true">
  <collectionProp name="Asserion.test_strings">
    <stringProp name="cd">200</stringProp>
  </collectionProp>
  <stringProp name="Assertion.custom_message">Unexpected HTTP status</stringProp>
  <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
  <boolProp name="Assertion.assume_success">false</boolProp>
  <intProp name="Assertion.test_type">8</intProp>
</ResponseAssertion>
<hashTree/></hashTree>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="StatVisualizer" enabled="true">
  <boolProp name="ResultCollector.error_logging">false</boolProp>
  <stringProp name="filename">23127249_Stress_20260830.jtl</stringProp>
</ResultCollector>
<hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>